app/helpers/categories_helper.rb

SELECT "categories".* FROM "categories"
---
	def category_list
		Category.all.map {|category|  [category.name, category.id]}