app/controllers/home_controller.rb

	def index
		@products = Vendor::Product.all
		@categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"