app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "customer"], ["LIMIT", 1]]
---
  def set_role
    self.role_id = Role.find_by(name: "customer").id